app/controllers/app_controller.rb

	def main
		# @location_path = "/#{params[:path]}"
		@items = Item.all.to_json
---
SELECT "items".* FROM "items"